tap "adoptopenjdk/openjdk"
tap "azure/kubelogin"
tap "derailed/k9s"
tap "dracula/install"
tap "dwarvesf/tap"
tap "felixkratz/formulae"
tap "infisical/get-cli"
tap "jandedobbeleer/oh-my-posh"
tap "koekeishiya/formulae"
tap "nikitabobko/tap"
brew "amp"
brew "arp-scan"
brew "atuin"
brew "azure-cli"
brew "bat"
brew "broot"
brew "f3"
brew "fd"
brew "ffmpeg"
brew "fzf"
brew "gh"
brew "git"
brew "glow"
brew "graphviz"
brew "helix"
brew "helm"
brew "icu4c@76"
brew "ios-deploy"
brew "jj"
brew "jq"
brew "openjdk"
brew "kafka"
brew "kakoune"
brew "kubernetes-cli"
brew "lazygit"
brew "lsd"
brew "lua"
brew "luarocks"
brew "lynx"
brew "midnight-commander"
brew "mise"
brew "neovim"
brew "nowplaying-cli"
brew "oh-my-posh"
brew "openjdk@17"
brew "pipenv"
brew "pkgconf"
brew "pre-commit"
brew "protobuf"
brew "pyenv"
brew "rbenv"
brew "ripgrep"
brew "starship"
brew "stow"
brew "switchaudio-osx"
brew "tmux"
brew "tree"
brew "trivy"
brew "uv"
brew "watchman"
brew "azure/kubelogin/kubelogin"
brew "derailed/k9s/k9s"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
brew "infisical/get-cli/infisical"
brew "koekeishiya/formulae/skhd"
cask "aerospace"
cask "alt-tab"
cask "amethyst"
cask "android-platform-tools"
cask "android-studio"
cask "appcleaner"
cask "background-music"
cask "balenaetcher"
cask "bartender"
cask "battery"
cask "bruno"
cask "ccleaner"
cask "chatgpt"
cask "discord"
cask "docker-desktop"
cask "dracula-terminal"
cask "emacs-app"
cask "fanny"
cask "figma"
cask "firefox"
cask "font-hack-nerd-font"
cask "font-jetbrains-mono-nerd-font"
cask "font-material-design-icons-webfont"
cask "font-sf-mono"
cask "font-sf-pro"
cask "fontbase"
cask "garmin-express"
cask "ghostty"
cask "github"
cask "google-chrome"
cask "google-drive"
cask "intellij-idea"
cask "iterm2"
cask "itermbrowserplugin"
cask "karabiner-elements"
cask "keepassxc"
cask "kindavim"
cask "kitty"
cask "linearmouse"
cask "lm-studio"
cask "logi-options+"
cask "mactex"
cask "messenger"
cask "microsoft-edge"
cask "miro"
cask "mongodb-compass"
cask "mos"
cask "mysqlworkbench"
cask "neovide-app"
cask "obs"
cask "obsidian"
cask "onedrive"
cask "orion"
cask "postman"
cask "pycharm"
cask "raspberry-pi-imager"
cask "raycast"
cask "rectangle"
cask "rive"
cask "rustrover"
cask "send-to-kindle"
cask "sf-symbols"
cask "signal"
cask "slack"
cask "sourcetree"
cask "spotify"
cask "ssh-config-editor"
cask "stremio"
cask "telegram"
cask "the-archive"
cask "topnotch"
cask "tor-browser"
cask "tradingview"
cask "tunnelblick"
cask "ungoogled-chromium"
cask "visual-studio-code"
cask "warp"
cask "webstorm"
cask "wezterm"
cask "whatsapp"
cask "zed"
cask "zettlr"
vscode "adpyke.vscode-sql-formatter"
vscode "ahmadalli.vscode-nginx-conf"
vscode "anthropic.claude-code"
vscode "apollographql.vscode-apollo"
vscode "astro-build.astro-vscode"
vscode "asvetliakov.vscode-neovim"
vscode "atlassian.atlascode"
vscode "aykutsarac.jsoncrack-vscode"
vscode "biomejs.biome"
vscode "bradlc.vscode-tailwindcss"
vscode "bruno-api-client.bruno"
vscode "catppuccin.catppuccin-vsc"
vscode "catppuccin.catppuccin-vsc-icons"
vscode "christian-kohler.npm-intellisense"
vscode "davidanson.vscode-markdownlint"
vscode "dbaeumer.vscode-eslint"
vscode "denoland.vscode-deno"
vscode "docker.docker"
vscode "donjayamanne.githistory"
vscode "dotjoshjohnson.xml"
vscode "dracula-theme.theme-dracula"
vscode "dsznajder.es7-react-js-snippets"
vscode "dustypomerleau.rust-syntax"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "enkia.tokyo-night"
vscode "esbenp.prettier-vscode"
vscode "ex-codes.pine-script-syntax-highlighter"
vscode "exodiusstudios.comment-anchors"
vscode "fallenmax.styled-components-extractor"
vscode "figma.figma-vscode-extension"
vscode "fill-labs.dependi"
vscode "github.codespaces"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.remotehub"
vscode "github.vscode-pull-request-github"
vscode "grapecity.gc-excelviewer"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-syntax"
vscode "hashicorp.terraform"
vscode "herrmannplatz.npm-dependency-links"
vscode "hverlin.mise-vscode"
vscode "jeylanib.pinescript"
vscode "jock.svg"
vscode "joshbolduc.commitlint"
vscode "kumar-harsh.graphql-for-vscode"
vscode "local-smart.excel-live-server"
vscode "meganrogge.template-string-converter"
vscode "mhutchie.git-graph"
vscode "mikestead.dotenv"
vscode "mindaro-dev.file-downloader"
vscode "mrmlnc.vscode-apache"
vscode "ms-azure-devops.azure-pipelines"
vscode "ms-azuretools.vscode-azure-github-copilot"
vscode "ms-azuretools.vscode-azure-mcp-server"
vscode "ms-azuretools.vscode-azureresourcegroups"
vscode "ms-azuretools.vscode-containers"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode-remote.remote-wsl"
vscode "ms-vscode-remote.vscode-remote-extensionpack"
vscode "ms-vscode.azure-repos"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.remote-repositories"
vscode "ms-vscode.remote-server"
vscode "ms-vscode.sublime-keybindings"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vscode.vscode-js-profile-flame"
vscode "ms-vscode.vscode-speech"
vscode "ms-vsliveshare.vsliveshare"
vscode "ms-windows-ai-studio.windows-ai-studio"
vscode "msjsdiag.vscode-react-native"
vscode "mskelton.react-emotion-snippets"
vscode "oderwat.indent-rainbow"
vscode "openai.chatgpt"
vscode "orta.vscode-jest"
vscode "oven.bun-vscode"
vscode "oxc.oxc-vscode"
vscode "pkief.material-icon-theme"
vscode "prisma.prisma"
vscode "redhat.vscode-yaml"
vscode "serkonda7.vscode-vba"
vscode "sidneys1.gitconfig"
vscode "sonarsource.sonarlint-vscode"
vscode "streetsidesoftware.code-spell-checker"
vscode "streetsidesoftware.code-spell-checker-british-english"
vscode "streetsidesoftware.code-spell-checker-portuguese"
vscode "streetsidesoftware.code-spell-checker-portuguese-brazilian"
vscode "styled-components.vscode-styled-components"
vscode "sumneko.lua"
vscode "svsool.markdown-memo"
vscode "syler.sass-indented"
vscode "tamasfe.even-better-toml"
vscode "tauri-apps.tauri-vscode"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vitest.explorer"
vscode "vscode-icons-team.vscode-icons"
vscode "vscodevim.vim"
vscode "webben.browserslist"
vscode "william-voyek.vscode-nginx"
vscode "wix.vscode-import-cost"
vscode "xabikos.javascriptsnippets"
vscode "yoavbls.pretty-ts-errors"
